rule okta_suspicious_activity_reported {
  meta:
    author = "Algbra (Mikail Tunç)"
    description = "Matches when a user clicks on the 'report suspicious activity' link in an email sent from Okta"
    severity = "High"

  events:
    $udm.metadata.vendor_name = "Okta" nocase
    $udm.metadata.product_name = "Okta" nocase
    $udm.metadata.product_event_type = "user.account.report_suspicious_activity_by_enduser" nocase

  condition:
    $udm
}
