rule okta_support_agent_impersonation {
  meta:
    author = "Algbra (Mikail Tunç)"
    description = "Matches when an Okta support agent attempts to impersonate an Okta user"
    severity = "High"

  events:
    $udm.metadata.vendor_name = "Okta" nocase
    $udm.metadata.product_name = "Okta" nocase
    $udm.metadata.product_event_type = "user.session.impersonation.initiate" nocase

  condition:
    $udm
}
