rule okta_failed_logins_across_valid_accounts {
  meta:
    author = "Algbra (Mikail Tunç) | SEP2 (Jon Cumiskey)"
    description = "Matches when there are failed logins across valid Okta users from a single IP address"
    severity = "Medium"

  events:
    $udm.metadata.vendor_name = "Okta" nocase
    $udm.metadata.product_name = "Okta" nocase
    $udm.metadata.product_event_type = "user.authentication.auth_via_mfa" nocase
    $udm.security_result.category_details = "INVALID_CREDENTIALS" nocase
    $user = $udm.principal.user.userid
    $ip = $udm.principal.ip       

  match:
    $ip over 30m

  condition:
    #user > 1
}
