rule google_workspace_reported_phish {
  meta:
    author = "Algbra (Mikail Tunç)"
    description = "Matches when someone reports a phishing email"
    severity = "High"

  events:
      $udm.metadata.product_name = "Google Workspace Alerts" nocase
      $udm.metadata.vendor_name = "Google Workspace" nocase
      $udm.metadata.event_type = "EMAIL_TRANSACTION"
      $udm.metadata.product_event_type = "MailPhishing" nocase

  condition:
    $udm
}
