rule github_deploy_key_added_to_repository {
  meta:
    author = "Algbra (Mikail Tunç)"
    description = "Matches when a deploy key is added to a repository"
    severity = "Low"
  events:
    $udm.metadata.vendor_name = "GITHUB" nocase
    $udm.metadata.product_name = "GITHUB" nocase
    $udm.metadata.product_event_type = "public_key.create" nocase

  condition:
    $udm
}
